; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v5 ?v7)
             (pred_2 ?v8 ?v13)
             (pred_1 ?v5 ?v13)
             (pred_3 ?v2 ?v5 )
	     (pred_7 ?v5)
             (pred_4 ?v3)
             (pred_9 ?v8)
             (pred_5 ?v13)
             (pred_11 ?v5)
             (pred_8 ?v8)
             (pred_12 ?v5)
             (pred_10 ))



(:action op_1
:parameters (?v11 ?v10 ?v4 ?v1)
:precondition (and (pred_4 ?v11) (pred_4 ?v10) (pred_9 ?v4) (pred_5 ?v1)
          (pred_6 ?v11 ?v10) (pred_2 ?v4 ?v1)
                   (pred_1 ?v10 ?v1) (pred_7 ?v11) 
                   (pred_11 ?v10) (pred_8 ?v4))
:effect (and  (pred_12 ?v10) (not (pred_11 ?v10))))


(:action op_3
:parameters (?v11 ?v9)
:precondition (and (pred_4 ?v11) (pred_4 ?v9)
               (pred_7 ?v11) (pred_6 ?v11 ?v9) (pred_12 ?v9))
:effect (and (pred_7 ?v9) (not (pred_7 ?v11))))

(:action op_2
:parameters (?v11 ?v4)
:precondition (and (pred_4 ?v11) (pred_9 ?v4) 
                  (pred_7 ?v11) (pred_3 ?v4 ?v11) (pred_10 ))
:effect (and (pred_8 ?v4)
   (not (pred_3 ?v4 ?v11)) (not (pred_10 ))))


(:action op_5
:parameters (?v11 ?v6 ?v12)
:precondition (and (pred_4 ?v11) (pred_9 ?v6) (pred_9 ?v12)
                  (pred_7 ?v11) (pred_8 ?v12) (pred_3 ?v6 ?v11))
:effect (and (pred_8 ?v6) (pred_3 ?v12 ?v11)
        (not (pred_8 ?v12)) (not (pred_3 ?v6 ?v11))))

(:action op_4
:parameters (?v11 ?v4)
:precondition (and (pred_4 ?v11) (pred_9 ?v4) 
                  (pred_7 ?v11) (pred_8 ?v4))
:effect (and (pred_10 ) (pred_3 ?v4 ?v11) (not (pred_8 ?v4)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_27 obj_19 obj_11 obj_29 obj_25 obj_15 obj_01 obj_13 obj_28 obj_30 obj_18 obj_24 obj_14 obj_31 obj_05 obj_21 obj_16 obj_22 obj_08 obj_02 obj_09 obj_17 obj_04 obj_07 obj_06
    obj_26 obj_03 obj_20
    obj_12 obj_10 obj_23
    )

    (:init
       (pred_10)

       (pred_4 obj_27)
       (pred_4 obj_19)
       (pred_4 obj_11)
       (pred_4 obj_29)
       (pred_4 obj_25)
       (pred_4 obj_15)
       (pred_4 obj_01)
       (pred_4 obj_13)
       (pred_4 obj_28)
       (pred_4 obj_30)
       (pred_4 obj_18)
       (pred_4 obj_24)
       (pred_4 obj_14)
       (pred_4 obj_31)
       (pred_4 obj_05)
       (pred_4 obj_21)
       (pred_4 obj_16)
       (pred_4 obj_22)
       (pred_4 obj_08)
       (pred_4 obj_02)
       (pred_4 obj_09)
       (pred_4 obj_17)
       (pred_4 obj_04)
       (pred_4 obj_07)
       (pred_4 obj_06)
       (pred_5 obj_26)
       (pred_5 obj_03)
       (pred_5 obj_20)
       (pred_9 obj_12)
       (pred_9 obj_10)
       (pred_9 obj_23)

       (pred_6 obj_27 obj_15)
       (pred_6 obj_27 obj_19)
       (pred_6 obj_19 obj_01)
       (pred_6 obj_19 obj_11)
       (pred_6 obj_19 obj_27)
       (pred_6 obj_11 obj_13)
       (pred_6 obj_11 obj_29)
       (pred_6 obj_11 obj_19)
       (pred_6 obj_29 obj_28)
       (pred_6 obj_29 obj_25)
       (pred_6 obj_29 obj_11)
       (pred_6 obj_25 obj_30)
       (pred_6 obj_25 obj_29)
       (pred_6 obj_15 obj_18)
       (pred_6 obj_15 obj_01)
       (pred_6 obj_15 obj_27)
       (pred_6 obj_01 obj_24)
       (pred_6 obj_01 obj_13)
       (pred_6 obj_01 obj_19)
       (pred_6 obj_01 obj_15)
       (pred_6 obj_13 obj_14)
       (pred_6 obj_13 obj_28)
       (pred_6 obj_13 obj_11)
       (pred_6 obj_13 obj_01)
       (pred_6 obj_28 obj_31)
       (pred_6 obj_28 obj_30)
       (pred_6 obj_28 obj_29)
       (pred_6 obj_28 obj_13)
       (pred_6 obj_30 obj_05)
       (pred_6 obj_30 obj_25)
       (pred_6 obj_30 obj_28)
       (pred_6 obj_18 obj_21)
       (pred_6 obj_18 obj_24)
       (pred_6 obj_18 obj_15)
       (pred_6 obj_24 obj_16)
       (pred_6 obj_24 obj_14)
       (pred_6 obj_24 obj_01)
       (pred_6 obj_24 obj_18)
       (pred_6 obj_14 obj_22)
       (pred_6 obj_14 obj_31)
       (pred_6 obj_14 obj_13)
       (pred_6 obj_14 obj_24)
       (pred_6 obj_31 obj_08)
       (pred_6 obj_31 obj_05)
       (pred_6 obj_31 obj_28)
       (pred_6 obj_31 obj_14)
       (pred_6 obj_05 obj_02)
       (pred_6 obj_05 obj_30)
       (pred_6 obj_05 obj_31)
       (pred_6 obj_21 obj_09)
       (pred_6 obj_21 obj_16)
       (pred_6 obj_21 obj_18)
       (pred_6 obj_16 obj_17)
       (pred_6 obj_16 obj_22)
       (pred_6 obj_16 obj_24)
       (pred_6 obj_16 obj_21)
       (pred_6 obj_22 obj_04)
       (pred_6 obj_22 obj_08)
       (pred_6 obj_22 obj_14)
       (pred_6 obj_22 obj_16)
       (pred_6 obj_08 obj_07)
       (pred_6 obj_08 obj_02)
       (pred_6 obj_08 obj_31)
       (pred_6 obj_08 obj_22)
       (pred_6 obj_02 obj_06)
       (pred_6 obj_02 obj_05)
       (pred_6 obj_02 obj_08)
       (pred_6 obj_09 obj_17)
       (pred_6 obj_09 obj_21)
       (pred_6 obj_17 obj_04)
       (pred_6 obj_17 obj_16)
       (pred_6 obj_17 obj_09)
       (pred_6 obj_04 obj_07)
       (pred_6 obj_04 obj_22)
       (pred_6 obj_04 obj_17)
       (pred_6 obj_07 obj_06)
       (pred_6 obj_07 obj_08)
       (pred_6 obj_07 obj_04)
       (pred_6 obj_06 obj_02)
       (pred_6 obj_06 obj_07)
       (pred_11 obj_17)
       (pred_11 obj_18)
       (pred_11 obj_25)
       (pred_1  obj_17 obj_26)
       (pred_1  obj_18 obj_03)
       (pred_1  obj_25 obj_20)
       (pred_12 obj_27)
       (pred_12 obj_19)
       (pred_12 obj_11)
       (pred_12 obj_29)
       (pred_12 obj_15)
       (pred_12 obj_01)
       (pred_12 obj_13)
       (pred_12 obj_28)
       (pred_12 obj_30)
       (pred_12 obj_24)
       (pred_12 obj_14)
       (pred_12 obj_31)
       (pred_12 obj_05)
       (pred_12 obj_21)
       (pred_12 obj_16)
       (pred_12 obj_22)
       (pred_12 obj_08)
       (pred_12 obj_02)
       (pred_12 obj_09)
       (pred_12 obj_04)
       (pred_12 obj_07)
       (pred_12 obj_06)

       (pred_2  obj_12 obj_26)
       (pred_2  obj_10 obj_03)
       (pred_2  obj_23 obj_20)
       (pred_3 obj_12 obj_08)
       (pred_3 obj_10 obj_09)
       (pred_3 obj_23 obj_19)
       (pred_7 obj_08)
    )

    (:goal (and
       (pred_3 obj_12 obj_09)
       (pred_3 obj_23 obj_21)
    ))
(:constraints
  (always (not (pred_7 obj_22)))
)
)

; plan
1. (op_2 obj_08 obj_12)
   deleted: (pred_3 obj_12 obj_08) (pred_10)
   added: (pred_8 obj_12)
   goals met: 0 of 2
2. (op_3 obj_08 obj_31)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_31)
   goals met: 0 of 2
3. (op_3 obj_31 obj_14)
   deleted: (pred_7 obj_31)
   added: (pred_7 obj_14)
   goals met: 0 of 2
4. (op_3 obj_14 obj_24)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_24)
   goals met: 0 of 2
5. (op_3 obj_24 obj_01)
   deleted: (pred_7 obj_24)
   added: (pred_7 obj_01)
   goals met: 0 of 2
6. (op_3 obj_01 obj_19)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_19)
   goals met: 0 of 2
7. (op_5 obj_19 obj_23 obj_12)
   deleted: (pred_8 obj_12) (pred_3 obj_23 obj_19)
   added: (pred_8 obj_23) (pred_3 obj_12 obj_19)
   goals met: 0 of 2
8. (op_3 obj_19 obj_01)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_01)
   goals met: 0 of 2
9. (op_3 obj_01 obj_24)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_24)
   goals met: 0 of 2
10. (op_3 obj_24 obj_16)
   deleted: (pred_7 obj_24)
   added: (pred_7 obj_16)
   goals met: 0 of 2
11. (op_3 obj_16 obj_21)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_21)
   goals met: 0 of 2
12. (op_4 obj_21 obj_23)
   deleted: (pred_8 obj_23)
   added: (pred_10) (pred_3 obj_23 obj_21)
   goals met: 1 of 2
13. (op_3 obj_21 obj_16)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_16)
   goals met: 1 of 2
14. (op_3 obj_16 obj_24)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_24)
   goals met: 1 of 2
15. (op_3 obj_24 obj_01)
   deleted: (pred_7 obj_24)
   added: (pred_7 obj_01)
   goals met: 1 of 2
16. (op_3 obj_01 obj_19)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_19)
   goals met: 1 of 2
17. (op_2 obj_19 obj_12)
   deleted: (pred_3 obj_12 obj_19) (pred_10)
   added: (pred_8 obj_12)
   goals met: 1 of 2
18. (op_3 obj_19 obj_01)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_01)
   goals met: 1 of 2
19. (op_3 obj_01 obj_24)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_24)
   goals met: 1 of 2
20. (op_3 obj_24 obj_16)
   deleted: (pred_7 obj_24)
   added: (pred_7 obj_16)
   goals met: 1 of 2
21. (op_3 obj_16 obj_21)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_21)
   goals met: 1 of 2
22. (op_3 obj_21 obj_09)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_09)
   goals met: 1 of 2
23. (op_5 obj_09 obj_10 obj_12)
   deleted: (pred_8 obj_12) (pred_3 obj_10 obj_09)
   added: (pred_8 obj_10) (pred_3 obj_12 obj_09)
   goals met: 2 of 2
